#+title: Emacs for Live
#+author: jonnay

* Setup

Make sure you install osc.el

This is done up org-mode style.  For now just do ~(org-babel-load-file /this-file/)~ and it will set everything up.  A proper elisp file is on the todo list.

You can bootstrap this file by moving the point into this code block and hitting C-c C-c
#+begin_src emacs-lisp :tangle no
(use-package osc)
(org-babel-load-file "emacs-for-live.org")
#+end_src


#+RESULTS:
: Loaded emacs-for-live.el


** Setting up a live inspector handler

   With that done we can get even more better.  We set up an osc-server handler to listen to ~/live-object~ messages and then output them to a buffer.  The handler will dispatch each result back from live.object to a helper function in the format of ~e4l--live-object-type-handler~. We'll also define a fallback called ~e4l--live-object-unfound-handler-handler~.

   The main object handler will set up a buffer called ~*e4l-object*~, and then each individual handler function writes to it.  Since we "know" ~id~ will be the first result back, we take this opportunity to erase the buffer. This will surely be the cause of some bugs later.

   The ~done~ handler is a cheeky no-op.

   Note that we're doing a pop-to-buffer then switch-to-buffer because I am a little hazy on how to pop up the window without hosing focus.
   
#+begin_src emacs-lisp
(defun e4l-live-object-handler (path arg)
  (with-current-buffer (get-buffer-create "*e4l-object*")
    (let* ((item (eval (read (concat "'" arg))))
           (type (car item))
           (args (cdr item))
           (fn-name (intern-soft (concat "e4l--live-object-" (symbol-name type) "-handler")))
           (fn (if fn-name fn-name 'e4l--live-object-unfound-handler-handler)))
      (funcall fn type args)))
  (when (string-equal "done" arg)
    (pop-to-buffer "*e4l-object*")))

(defun e4l--live-object-id-handler (type args)
  (erase-buffer)
  (insert (format "ID: %s\n" (car args))))

(defun e4l--live-object-type-handler (type args)
  (insert (format "%s\n" (car args))))

(defun e4l--live-object-description-handler (type args)
  (insert (string-join (mapcar #'prin1-to-string args) " "))
  (insert "\n\n"))

(defun e4l--live-object-unfound-handler-handler (type args)
  (insert (format "[%s] %S\n" type args)))

(defun e4l--live-object-done-handler (type args)
  (insert "\n\nSuperPowers!"))

(osc-server-set-handler e4l-osc-server "/live-object" #'e4l-live-object-handler)


#+end_src

#+RESULTS:
| :generic | e4l-echo-handler | :handlers | ((/live-object . e4l-live-object-handler)) |

Now anytime that s4m sends /live-object to us, we'll get a buffer full of information about the live object under inspection!


